openfoam_cases/case1/constant/table-values
// -*- C++ -*-
// Some table values

(
    (0 0)
    (20 1)
);

// ************************************************************************* //
