openfoam_cases/case1/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

DT              [ 0 2 -1 0 0 0 0 ] 0;

sigma           [ 1 0 -2 0 0 0 0 ] 0;

phase1
{
    transportModel  Newtonian;
    nu              [ 0 2 -1 0 0 0 0 ] 0;
    rho             [ 1 -3 0 0 0 0 0 ] 1000;
    BirdCarreauCoeffs
    {
        nu0             [ 0 2 -1 0 0 0 0 ] 0.0142515;
        nuInf           [ 0 2 -1 0 0 0 0 ] 1e-06;
        k               [ 0 0 1 0 0 0 0 ] 99.6;
        n               [ 0 0 0 0 0 0 0 ] 0.1003;
    }
    CrossPowerLawCoeffs
    {
        nu0             [ 0 2 -1 0 0 0 0 ] 1e-06;
        nuInf           [ 0 2 -1 0 0 0 0 ] 1e-06;
        m               [ 0 0 1 0 0 0 0 ] 1;
        n               [ 0 0 0 0 0 0 0 ] 0;
    }
}

phase2
{
    transportModel  Newtonian;
    nu              [ 0 2 -1 0 0 0 0 ] 0;
    rho             [ 1 -3 0 0 0 0 0 ] 1;
    BirdCarreauCoeffs
    {
        nu0             [ 0 2 -1 0 0 0 0 ] 0.0142515;
        nuInf           [ 0 2 -1 0 0 0 0 ] 1e-06;
        k               [ 0 0 1 0 0 0 0 ] 99.6;
        n               [ 0 0 0 0 0 0 0 ] 0.1003;
    }
    CrossPowerLawCoeffs
    {
        nu0             [ 0 2 -1 0 0 0 0 ] 1e-06;
        nuInf           [ 0 2 -1 0 0 0 0 ] 1e-06;
        m               [ 0 0 1 0 0 0 0 ] 1;
        n               [ 0 0 0 0 0 0 0 ] 0;
    }
}

// ************************************************************************* //
